let handler = async (m, { conn }) => {
conn.reply(m.chat,`━━━━━━━⬣ *😍* ⬣━━━━━━━“${pickRandom(global.verdaad)}“━━━━━━━⬣ *😍* ⬣━━━━━━━`, m)
}
handler.help = ['لمنشن']
handler.tags = ['fun']
handler.command = /^تاج/i
export default handler
function pickRandom(list) {
return list[Math.floor(list.length * Math.random())]
}
global.verdaad = [
"تامن منشن بضان",
"تالت منشن عمك", 
"اول منشن بيتطس", 
"ثاني منشن بيحب وحده هنا ف الروم و محدش يعرف🙂😂", 
" خامس منشن طيزو حمرا", 
"عاشر منشن بياخد ع قفاه", 
"ثالث منشن خسيس كلب جبان😂😂", 
"تاني منشن انت عمه", 
"ثالث منشن بيحب يحكها", 
"ثالث منشن يشوف رونالدو عمو", 
"سابع منشن توته كبيره ", 
" تالت منشن يحبك", 
" رابع منشن غدار", 
" خامس منشن دمج", 
" خامس منشن بيحب امك ", 
"تاسع منشن بيحب حبيبتك ", 
" سابع منشن ملوش فيها", 
" اول منشن بيكراش عليك", 
" اول منشن زهقان منك", 
" ثالث منشن بارد فشخ انا كا بوت مش بحبو", 
" سادس منشن احسن منك", 
" اول منشن هيهرب بيحب تامن منشن", 
"ثالث منشن شذ", 
"ثالث منشن يثق فيك بس مش بيحبك ازاي معرفش", 
"ثاني منشن زهق منك", 
"رابع منشن بيحب الانمي اكتر من امو ابوه", 
"خامس منشن غبي", 
"رابع منشن خروف" , 
"ثاني منشن بيكرهك" , 
"اول منشن يحبك" , 
"ثالث منشن بيموت ف خامس منشن" , 
"هش بقا صدعتني" , 
"ثالث منشن بيكرهك" , 
"ثاني منشن فخم" , 
"اول منشن عامل نفسو جامد و هوا بياخدو جامد" , 
"خامس منشن اذكي من عيلتك كلها" , 
"رابع منشن اغبي واحد ف الشله" , 
"اول منشن بيفديك ب روحه" , 
"سادس منشن ليز ب معني شذ" , 
"تالت منشن يراقبك من حبو فيك" , 
"تاسع منشن يشوفك بطل" , 
" رابع منشن يشوفك احبه"
]