import translate from '@vitalets/google-translate-api'
import fetch from 'node-fetch'
import axios from "axios"

let handler = async (m, { conn, usedPrefix, command }) => {
  let fkontak = { 
    "key": { "participants":"0@s.whatsapp.net", "remoteJid": "status@broadcast", "fromMe": false, "id": "Halo" }, 
    "message": { 
      "contactMessage": { 
        "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD` 
      }
    }, 
    "participant": "0@s.whatsapp.net" 
  }

  try { 
    if (command == 'consejo' || command == 'advice') { 
      let img = 'https://img.freepik.com/vector-premium/caracter-gato-ilustracion-hoja-trebol_75474-1263.jpg'
      let list = global.motivation 
      let contenido = list[Math.floor(Math.random() * list.length)]
      let result = await translate(`${contenido}`, { to: 'ar', autoCorrect: true })
      let texto = `
**╭━━・🧚🏼‍♂️・𝑻𝑼𝑹𝑩𝑶 𝑩𝑶𝑻・🧚🏼‍♂️・━━⬣**

**ღ _${result.text}_**

**╰━━・🧚🏼‍♂️・بوت تيربو・🧚🏼‍♂️・━━⬣**`
      conn.sendButton(m.chat, texto.trim(), botname, img, [['✨ 𝐒𝐢𝐠𝐮𝐢𝐞𝐧𝐭𝐞 ✨', `/${command}`]], null, null, m)
    }

    if (command == 'frase2' || command == 'phrase2') { 
      let img = 'https://superpet.pe/blog/wp-content/uploads/2022/05/nombres-para-gatos-blancos.jpg'  
      let list = (await axios.get(`https://raw.githubusercontent.com/GataNina-Li/GataBot-MD/master/src/JSON/frase2.json`)).data  
      let contenido = await list[Math.floor(list.length * Math.random())]
      let frase = contenido.motivasi
      let frase2 = await translate(`${frase}`, { to: 'ar', autoCorrect: true })
      let texto = `
**╭━━・☘️・━━━━・☘️・━━⬣**

**ღ ${frase2.text}**

**╰━━・☘️・━━━━・☘️・━━⬣**`
      conn.sendButton(m.chat, texto.trim(), botname, img, [['✨ 𝐒𝐢𝐠𝐮𝐢𝐞𝐧𝐭𝐞 ✨', `/${command}`]], null, null, m)
    } 
  } catch (e) {
    await m.react(`❌`) 
    console.log(e)
  }  
}

handler.help = ['consejo']
handler.tags = ['downloader']
handler.command = ['نصيحه', 'انصحني', 'نصيحة', 'phrase2']
handler.register = true
handler.limit = 1
handler.level = 2
export default handler

global.motivation = [
  "ما تتكلمش، اتحرك. ما تقولش، ورّي. ما توعدش، أثبت.",
  "ما تتوقفش عن عمل أفضل ما عندك بس عشان حد ما قدّركش.",
  "اشتغل لما هما نايمين. اتعلم لما هما بيسهروا. وفّر لما هما بيصرفوا. عيش زي ما هما بيحلموا.",
  "مفتاح النجاح هو إنك تركز عقلك الواعي على اللي إنت عايزه، مش اللي إنت خايف منه.",
  "ما تخافش تفشل. الخوف إنك تكون في نفس المكان السنة الجاية زي دلوقتي.",
  "لو فضلنا نعمل اللي بنعمله، هنفضل نحصل على نفس النتائج.",
  "لو مش قادر تتعامل مع الضغط، مش هتقدر تدير النجاح.",
  "كن عنيد في أهدافك ومرن في طرقك.",
  "العمل الجاد بيهزم الموهبة لما الموهبة ما تشتغلش بجد.",
  "افتكر إن أعظم الدروس في الحياة بتتعلم من أسوأ اللحظات ومن أسوأ الأخطاء.",
  "الحياة مش إنك تستنى العاصفة تعدي، لكن تتعلم ترقص تحت المطر.",
  "لو الخطة ما نجحتش، غيّر الخطة مش الهدف.",
  "ما تخافش إن حياتك هتنتهي؛ خاف إن حياتك ما بدأتش.",
  "الناس العظماء بجد هما اللي بيخلوا كل واحد يحس إنه عظيم.",
  "التجربة هي المعلم الصعب لأنها بتديك الامتحان الأول، وبعدها الدرس.",
  "معرفة قد إيه تحتاج تعرفه هو بداية التعلم للحياة.",
  "النجاح مش النهاية، الفشل مش قاتل. الأهم هو الشجاعة للاستمرار.",
  "أفضل تفشل في الأصالة من إنك تنجح في التقليد.",
  "كن جريء في أحلامك، لكن الأهم، كن جريء في تنفيذ أحلامك.",
  "حدد أهدافك عالية، وما توقفش لحد ما تحققها.",
  "ابني النجاح من الفشل. اليأس والفشل هما أحجار الأساس الأكثر تأكيدًا للنجاح.",
  "العبقرية هي 1٪ إلهام و99٪ عرق.",
  "النجاح هو المكان اللي بيجتمع فيه التحضير والفرصة.",
  "الإصرار بيفشل 19 مرة وبينجح في المرة العشرين.",
  "الطريق للنجاح والطريق للفشل شبه بعض جدًا.",
  "النجاح بيجي عادة للناس اللي مشغولة جدًا في البحث عنه.",
  "ما تأجلش شغلك لبكرة، طالما ممكن تعمله النهاردة.",
  "بعد 20 سنة من دلوقتي، ممكن تندم أكتر على الحاجات اللي ما عملتهاش بدل الحاجات اللي عملتها.",
  "ما تضيعش وقتك في ضرب الحائط وتتمنى إنه يتحول لباب.",
  "الفرصة زي شروق الشمس. لو استنيت كتير، ممكن تفوتك.",
  "الحياة بتتكون من 10٪ اللي بيحصل لك و90٪ إزاي تتعامل معاه.",
  "فيه 3 طرق لتحقيق النجاح الأعظم: الأولى إنك تكون طيب. التانية إنك تكون طيب. التالتة إنك تكون طيب.",
  "السبب الرئيسي لفشل الناس في الحياة هو إنهم بيسمعوا لأصحابهم، أسرتهم، وجيرانهم.",
  "الوقت أغلى من الفلوس. ممكن تكسب فلوس أكتر، لكن ما تقدرش تكسب وقت أكتر.",
  "تحديد الأهداف هو سر مستقبل مشرق.",
  "لما نحاول نكون أحسن من اللي إحنا عليه، كل حاجة حوالينا بتتحسن برضه.",
  "النمو بيبدأ لما نبدأ نقبل نقاط ضعفنا.",
  "ما تستسلمش أبدًا طالما قادر تحاول تاني. مافيش حاجة اسمها نهاية لحد ما توقف المحاولة.",
  "الإرادة هي مفتاح النجاح. الناس الناجحين بيجتهدوا مهما كانت مشاعرهم من خلال تطبيق إرادتهم للتغلب على الكسل، الشك أو الخوف.",
  "أول حاجة يعملها الناجحين هي النظر للفشل كإشارة إيجابية للنجاح.",
  "السمة المميزة للناجحين هي إنهم بيسعوا دايمًا لتعلم حاجات جديدة.",
  "النجاح هو الحصول على اللي إنت عايزه، السعادة هي إنك ترغب في اللي حصلت عليه.",
  "المتشائم بيشوف الصعوبة في كل فرصة. المتفائل بيشوف الفرصة في كل صعوبة.",
  "الشك بيموت أحلام أكتر من الفشل.",
  "اعمل اللي لازم تعمله لحد ما تقدر تعمل اللي عايز تعمله.",
  "التفاؤل هو واحدة من الصفات المرتبطة بالنجاح والسعادة أكتر من أي حاجة تانية.",
  "أعلى مكافأة للعامل الجاد مش اللي بياخده من شغله، لكن اللي بيصبحه من خلال شغله الجاد.",
  "أفضل طريقة للبدء هي التوقف عن الكلام والبدء في العمل.",
  "الفشل مش هيغلبك أبداً لو كانت عزيمتك على النجاح قوية بما فيه الكفاية."
]
